In [25]:
import pandas as pd
import numpy as np

df_stocks = pd.DataFrame({
    'tickers': ['GOOGL','WMT','MSFT','','BYE'],
    'price': ['',55,67,88,'']
})

df_weather = pd.DataFrame({
    'day': ['11/07/2018','15/07/2018','13/07/2018'],
    'temp': [45,67,89],
    'events': ['Rain','Sunny','Snow']
})

In [26]:
df_stocks

  price tickers
0         GOOGL
1    55     WMT
2    67    MSFT
3    88
4           BYE

In [27]:
df_weather

          day events  temp
0  11/07/2018   Rain    45
1  15/07/2018  Sunny    67
2  13/07/2018   Snow    89

In [28]:
with pd.ExcelWriter('files/stock_weather.xlsx') as writer:
    df_stocks.to_excel(writer, sheet_name = 'stocks')
    df_weather.to_excel(writer, sheet_name = 'weather')

In [80]:
df_w = pd.read_excel('files/stock_weather.xlsx', sheet_name = 'weather')
df_w

          day events  temp
0  11/07/2018   Rain    45
1  15/07/2018  Sunny    67
2  13/07/2018   Snow    89

In [108]:
df_s = pd.read_excel('files/stock_weather.xlsx', sheet_name = 'stocks')
#df_s = df_s.fillna(0)

In [83]:
df_s = df_s.fillna({
    'price': 0,
    'tickers' : 'Null'
})
df_s

   price tickers
0    0.0   GOOGL
1   55.0     WMT
2   67.0    MSFT
3   88.0    Null
4    0.0     BYE

In [94]:
df_s

   price tickers
0    NaN   GOOGL
1   55.0     WMT
2   67.0    MSFT
3   88.0     NaN
4    NaN     BYE

In [87]:
df_s = df_s.fillna(method='bfill')
df_s

   price tickers
0   55.0   GOOGL
1   55.0     WMT
2   67.0    MSFT
3   88.0     BYE
4    NaN     BYE

In [89]:
df_s = df_s.fillna(method='bfill', axis='columns')
df_s

   price tickers
0  GOOGL   GOOGL
1     55     WMT
2     67    MSFT
3     88     NaN
4    BYE     BYE

In [105]:
df_s = df_s.fillna(method='bfill', limit=1)
df_s

   price tickers
0   55.0   GOOGL
1   55.0     WMT
2   67.0    MSFT
3   88.0     BYE
4    NaN     BYE

In [103]:
df_s.interpolate(method='linear')

   price tickers
0    NaN   GOOGL
1   55.0     WMT
2   67.0    MSFT
3   88.0     NaN
4   88.0     BYE

In [111]:
df_s.dropna(how='all')    # drops the rows which have all the NaN values

   price tickers
0    NaN   GOOGL
1   55.0     WMT
2   67.0    MSFT
3   88.0     NaN
4    NaN     BYE

In [116]:
df_s.dropna(thresh=2)     # keeps the rows which have at least 2 *NON-NaN values*

   price tickers
1   55.0     WMT
2   67.0    MSFT